# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [5]:
#Your code here
import sqlite3
import pandas
con = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = con.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [13]:
#Your code here
cur.execute("""SELECT lastName, firstName, city, state FROM employees JOIN offices using(OfficeCode)""")
df = pandas.DataFrame(cur.fetchall())
df.columns= [i[0] for i in cur.description]
df.head(5)

    lastName firstName           city state
0     Murphy     Diane  San Francisco    CA
1  Patterson      Mary  San Francisco    CA
2   Firrelli      Jeff  San Francisco    CA
3  Patterson   William         Sydney
4     Bondur    Gerard          Paris

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [28]:
# Your code here
cur.execute("""SELECT contactFirstName as Fist_Name, contactLastName as Last_Name, orderNumber FROM customers c JOIN orders o 
 ON c.customerNumber = o.customerNumber""")
df2 = pandas.DataFrame(cur.fetchall())
df2.columns = [i[0] for i in cur.description]
df2.head(10)

  Fist_Name Last_Name orderNumber
0   Carine    Schmitt       10123
1   Carine    Schmitt       10298
2   Carine    Schmitt       10345
3      Jean      King       10124
4      Jean      King       10278
5      Jean      King       10346
6     Peter  Ferguson       10120
7     Peter  Ferguson       10125
8     Peter  Ferguson       10223
9     Peter  Ferguson       10342

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [30]:
# Your code here
cur.execute("""SELECT contactFirstName, paymentDate, amount 
FROM customers c JOIN payments USING(customerNumber)""")
df3 = pandas.DataFrame(cur.fetchall())
df3.columns = [i[0] for i in cur.description]
df3.head(5)

  contactFirstName paymentDate    amount
0          Carine   2003-06-05  14571.44
1          Carine   2004-10-19   6066.78
2          Carine   2004-12-18   1676.14
3             Jean  2003-06-06  32641.98
4             Jean  2004-08-20  33347.88

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [4]:
# Your code here
cur.execute("""SELECT contactLastName, orderDate, productName, quantityOrdered
FROM customers JOIN orders USING(customerNub)""")

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!